CSI API ETABS v1
cPropFrame.GetMaterial Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMaterial(
	string Name,
	ref string MatProp
)
Function GetMaterial (
	Name As String,
	ByRef MatProp As String
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatProp As String
Dim returnValue As Integer
returnValue = instance.GetMaterial(Name,
	MatProp)
int GetMaterial(
	String^ Name,
	String^% MatProp
)
abstract GetMaterial :
        Name : string *
        MatProp : string byref -> int
Parameters
Name
Type: System.String
MatProp
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace